#include "Bullet.h"

#include "Novice.h"

///=====================================================/// 
/// 初期化
///=====================================================///
void Bullet::Initialize(Vector2 pos) {

	//座標の初期化
	pos_ = pos;

	//半径の初期化
	radius_ = 10.0f;

	//移動速度の初期化
	speed_ = 15.0f;

	//死亡フラグの初期化
	isDead_ = false;

	//生存時間の初期化
	maxLifeTime_ = 2.0f;

	//時間の初期化
	time_ = 0.0f;
}

///=====================================================/// 
/// 更新
///=====================================================///
void Bullet::Update() {

	//時間を進める
	time_ += 1.0f / 60.0f;

	//時間が生存時間を越えていたら
	if (time_ >= maxLifeTime_) {

		//死亡フラグをtrueにする
		isDead_ = true;
	}

	//移動
	Move();
}

///=====================================================/// 
/// 描画
///=====================================================///
void Bullet::Draw() {

	//円で描画
	Novice::DrawEllipse(
		static_cast<int>(pos_.x),
		static_cast<int>(pos_.y),
		static_cast<int>(radius_),
		static_cast<int>(radius_),
		0.0f,
		WHITE,
		kFillModeSolid
	);
}

///=====================================================/// 
/// 移動
///=====================================================///
void Bullet::Move() {

	//上方向に移動
	pos_.y -= speed_;
}